/*
1. Построить процедуру, показывающую количество газа, которое остается в регионе и показать с ее помощью, в каких регионах добывают не весь газ.
2. Найти компанию, в которой работает самый старый сотрудник.
3. Вывести список компаний, присутствующих не более чем в двух регионах.
4. Найти регион, в котором работает больше всего сотрудников на одной вышке.
5. Найти максимальную разницу в возрасте сотрудников в одной компании среди всех компаний.
6. Вывести список эффективности вышек, где эффективность вышки есть отношение объема добычи к числу сотрудников на ней.
7. Построить курсор, который показывает информацию о вышках: в каком регионе находится, какой компании принадлежит, сколько сотрудников работает
*/
select * from Employees;