/*
1. Построить процедуру, показывающую количество газа, которое остается в регионе
и показать с ее помощью, в каких регионах добывают не весь газ.

2. Найти компанию, в которой работает самый старый сотрудник.

3. Создать триггер, который не позволит добавить сотрудника возрастом меньше 18 лет.

4. Найти регион, в котором работает больше всего сотрудников на одной вышке.

5. Построить процедуру, которая вычисляет эффективности вышек,
где эффективность вышки есть отношение объема добычи к числу сотрудников на ней.

6. Построить курсор, который показывает информацию о вышках:
в каком регионе находится, какой компании принадлежит, сколько сотрудников работает
*/
-- 1